app/views/petitions/index.html.erb

      <td><%= link_to "#{petition.title}", petition_path(petition) %></td>
      <td><%= petition.user.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]