app/controllers/petitions_controller.rb

  def index
    if params[:my].present? and params[:my].to_s == 'true'
      @petitions = current_user.petitions
    elsif params[:status].present? and params[:status].to_s == 'all'
      @petitions = Petition.all
    else
      @petitions = Petition.last(COUNT_PET)
---
SELECT "petitions".* FROM "petitions" WHERE "petitions"."user_id" = $1  [["user_id", 2]]
SELECT  "petitions".* FROM "petitions"  ORDER BY "petitions"."id" DESC LIMIT 10

  def show
    @petition = Petition.find(params[:id])
---
SELECT  "petitions".* FROM "petitions" WHERE "petitions"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @petition = Petition.find(params[:id])
---
SELECT  "petitions".* FROM "petitions" WHERE "petitions"."id" = $1 LIMIT 1  [["id", 5]]

  def create
    @petition = current_user.petitions.build(petition_params)

    @petition.save
---
INSERT INTO "petitions" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "123123"], ["text", "123123"], ["user_id", 5], ["created_at", "2016-03-07 16:25:51.536716"], ["updated_at", "2016-03-07 16:25:51.536716"]]

  def update
    @petition = Petition.find(params[:id])
    if @petition.published?
      redirect_to @petition, notice: 'Петиция просрочена, обновить нельзя!'
    end
    if @petition.user.id != current_user.id
      redirect_to root_path, notice: 'Нету доступа!'
    else
      if @petition.update(petition_params)
---
SELECT  "petitions".* FROM "petitions" WHERE "petitions"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "petitions" SET "title" = $1, "text" = $2, "updated_at" = $3 WHERE "petitions"."id" = $4  [["title", "hihihihh"], ["text", "hohohohoh"], ["updated_at", "2016-03-12 00:06:55.815336"], ["id", 8]]

  def destroy
    @petition = Petition.find(params[:id])
    @petition.destroy
---
SELECT  "petitions".* FROM "petitions" WHERE "petitions"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "petitions" WHERE "petitions"."id" = $1  [["id", 5]]

  def vote
    value = params[:type] == "up" ? 1 : -1
    @petition = Petition.find(params[:id])
---
SELECT  "petitions".* FROM "petitions" WHERE "petitions"."id" = $1 LIMIT 1  [["id", 1]]