app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "glory-gerrard@ukr.net"]]
---
  def create
    user = User.find_by_email(params[:email])